2)	A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch. 
Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.

#### Assumption-Null hyposthesis as H0: μ1 = μ2 = μ3 = μ4. There is no difference in Turn Around Time (TAT) for reports of 4 laboratories.

####  Alternate hypothesis as Ha: All μ are not equal.s At least, one group mean is different from other groups


####  As alternate hypothesis we need to check if there is any difference in average TAT among the different laboratories, we will do two tail testing.

In [16]:
### importing required libraries

import pandas as pd 
import numpy as np
from scipy import stats
from scipy.stats import f_oneway

In [2]:
### loading the data file

data = pd.read_csv("LabTAT.csv")
data.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [4]:
Lab1 = pd.Series(data.iloc[:,0])
Lab1

0      185.35
1      170.49
2      192.77
3      177.33
4      193.41
        ...
115    178.49
116    176.08
117    202.48
118    182.40
119    182.09
Name: Laboratory 1, Length: 120, dtype: float64

In [5]:
Lab2 = pd.Series(data.iloc[:,1])
Lab2

0      165.53
1      185.91
2      194.92
3      183.00
4      169.57
        ...
115    170.66
116    183.98
117    174.54
118    197.18
119    215.17
Name: Laboratory 2, Length: 120, dtype: float64

In [7]:
Lab3=pd.Series(data.iloc[:,2])
Lab3

0      176.70
1      198.45
2      201.23
3      199.61
4      204.63
        ...
115    193.80
116    215.25
117    203.99
118    194.52
119    221.49
Name: Laboratory 3, Length: 120, dtype: float64

In [19]:
Lab4 =pd.Series(data.iloc[:,3])
Lab4

0      166.13
1      160.79
2      185.18
3      176.42
4      152.60
        ...
115    172.68
116    177.64
117    170.27
118    150.87
119    162.21
Name: Laboratory 4, Length: 120, dtype: float64

In [21]:
statistic, pvalue =f_oneway(Lab1,Lab2,Lab3,Lab4)
alpha=0.05

print("p value is ",pvalue)
if pvalue<=alpha:
    print("Reject H0")
else:
    print("H0 holds true")

p value is  2.1156708949992414e-57
Reject H0

Hence the null hypothesis is rejected. That means that there is difference in average TAT among the different laboratories.